# IsValidIssue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedBuildIssue..::..IsValidIssue Method
TessellatedBuildIssue Class See Also
---
Reports whether the issue is well-formed, valid and does describe a real problem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsValidIssue()
```

Visual Basic
---
```text
Public Function IsValidIssue As Boolean
```

Visual C++
---
```text
public:
bool IsValidIssue()
```

# ### Return Value
Whether the issue is well formed and does describe a real problem.
# See Also
TessellatedBuildIssue Class
Autodesk.Revit.DB Namespace